Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportUIObjectPick(Tekla.Structures.ModelInternal.dotUIPicker_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportUIObjectsPick(Tekla.Structures.ModelInternal.dotUIPicker_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetSnapshotFromDatabase(Tekla.Structures.ModelInternal.dotEnumerator_t@,System.Collections.Generic.List{System.Object}@,System.Boolean)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetSolidSerialized(Tekla.Structures.ModelInternal.dotSolid_t@,System.Collections.Generic.List{System.Object}@,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Vector}@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.EndInvoke(Tekla.Structures.ModelInternal.dotUIPicker_t@,System.IAsyncResult)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportDasStartCommand(System.String,System.String)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportDasStartAction(System.String,System.String)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportRefreshReferenceModel(Tekla.Structures.ModelInternal.dotRefreshReferenceModel_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSaveOperation(Tekla.Structures.ModelInternal.dotSaveOperation_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCreateEmptyModel(Tekla.Structures.ModelInternal.dotModelInfo_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSharingOperation(Tekla.Structures.ModelInternal.dotSharingOperation_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ImportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportStringListHandler(Tekla.Structures.ModelInternal.dotnetStringList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ImportStringListHandler(Tekla.Structures.ModelInternal.dotnetStringList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.ImportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSaveOperation(Tekla.Structures.ModelInternal.dotSaveOperation_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotImportIntListHandler(Tekla.Structures.ModelInternal.dotnetIntList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportStringListHandler(Tekla.Structures.ModelInternal.dotnetStringList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotImportStringListHandler(Tekla.Structures.ModelInternal.dotnetStringList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotImportPointListHandler(Tekla.Structures.ModelInternal.dotnetPointList_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportShadowArea(Tekla.Structures.ModelInternal.dotAreaPolygons_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportShadowAreaComplement(Tekla.Structures.ModelInternal.dotAreaPolygons_t@)
DO NOT USE! For internal usage only!